micropython/micropython/ports/esp32/boards/DENEYAP_KART_G/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "DENEYAP_KART_G"
#define MICROPY_HW_MCU_NAME                 "ESP32-C3FN4"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "DeneyapKartG"

#define MICROPY_HW_ENABLE_SDCARD            (0)
#define MICROPY_PY_MACHINE_DAC              (0)
#define MICROPY_PY_MACHINE_I2S              (0)

#define MICROPY_HW_I2C0_SCL                 (2)
#define MICROPY_HW_I2C0_SDA                 (8)

#define MICROPY_HW_SPI1_MOSI                (6)
#define MICROPY_HW_SPI1_MISO                (5)
#define MICROPY_HW_SPI1_SCK                 (4)
